# Lab-Data-Manipulation (PART-1)

In [7]:
import pandas as pd

# Context 

For this lab you'll use a dataset for UFO observations. The objective is to exercise the manipulation of a dataframe, so we'll use the tools we've learned about `reading`, `renaming`, `selecting specific columns`, `filtering based on conditions` and `merging` dataframes to try to better understand our dataset and store an enriched version of our dataset at the end.

Good Luck.

variable	|class|	description
------------|-----|-------------
date_time	|datetime (mdy h:m)	| Date time sighting occurred
city_area	|character	        | City or area of sighting
state	    |character          |	state/region of sighting
country	    |character          |	Country of sighting
ufo_shape	|character          |	UFO Shape
encounter_length	|double     |	Encounter length in seconds
described_encounter_length	|character |	Encounter length as described (eg 1 hour, etc)
description	|character          |	Description of encounter
date_documented	|character      |	Date documented
latitude	|double             |	Latitude
longitude	|double             |	Longitude

## Read the dataset and store it in a dataframe called `ufo`

Pay attention at the file separator.

In [8]:
ufo = pd.read_csv('data/ufo.csv', sep=';')

## Check the first 6 columns of the dataframe

In [9]:
ufo.head(6)

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611
5,5,1961-10-10,1961,10,10,10/10/1961 19:00,bristol,tn,us,sphere,300.0,5 minutes,My father is now 89 my brother 52 the girl wit...,4/27/2007,36.595000,-82.188889

## Check the shape of your dataframe to see how many rows and columns it has

In [10]:
print(f'the dataframe has {ufo.shape[0]} rows and {ufo.shape[1]} columns')

the dataframe has 80332 rows and 16 columns

## Bring the date information to the beginning of the dataframe

If you check the dataframe columns, there are some information of the date at the end of the dataframe. For this task, you should reorder the columns in a way that the first few columns all show the date information. 

*Hint: Use the ufo.columns to see all the column names you have.

In [11]:
# primeiro cria-se uma lista e retira-se o nome da coluna na lista
cols = ufo.columns.tolist()
cols.remove('date_documented')
cols.remove('Unnamed')

ValueError: list.remove(x): x not in list

In [ ]:
#agora adiciona-se à posição que queremos na lista
cols = cols[1:6] + ['date_documented'] + ['Unnamed'] + cols[6:]
cols

In [ ]:
#ou então, copia na mão as colunas e reescreve na mão:
cols = ['date_documented','date', 'year', 'month', 'day', 'date_time', 'Unnamed: 0', 'city_area', 'state', 'country', 'ufo_shape', 'encounter_length', 'described_encounter_length', 'description', 'latitude', 'longitude']
cols

In [12]:
#re-create the dataframe:
ufo = ufo[cols]

## Just check if you did it the right way. Take a look at the head of the dataframe again and see if the `ufo` dataframe now is reordered.

In [13]:
ufo.head()

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

## Select a piece of your dataframe. Create a new dataframe called `ufo_vars` and select only the following columns of the `ufo` dataframe. 

`year`, `month`, `state`, `country`, `ufo_shape`, `encounter_length`

In [14]:
ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]

Perform a *.head()* on your result to check if you did it right.

In [15]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
1  1949     10    tx     NaN     light            7200.0
2  1955     10   NaN      gb    circle              20.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0

## Rename the variable `encounter_length` to `encounter_seconds`. Keep using the `ufo_vars` dataset for the following tasks, unless specifically specified.

Again, check your results to check if you did it right.

In [16]:
ufo_vars = ufo_vars.rename({'encounter_length': 'encounter_seconds'}, axis=1)
ufo_vars.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
1  1949     10    tx     NaN     light             7200.0
2  1955     10   NaN      gb    circle               20.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0

## Let's start filtering some records. Create a new dataframe called `ufo_us` and filter the `ufo_vars` dataframe bringing only the results in which the `country` is `"us"`

### Use a mask to perform this task 

A `mask` is nothing more than a condition. This condition is applied to your whole dataframe (or pandas Series).
So for example, if you had a pandas Series with a variable called `Age`, you could create a mask for all people whose `Age` is less than 18 years old using the syntax:

`df['Age'] <= 18`

This would return a pandas series containing `True` and `False` values. For each index, you'd get a value of `True` or `False`.

You could save this mask in a variable, for example:

`condition = (df['Age'] <= 18)`

And then you could use that variable `condition` to select only the cases of the dataframe in which the index returned `True` using:
df[condition].

In [17]:
mask = (ufo_vars['country'] == 'us')
ufo_us = ufo_vars[mask]

### Use the .query() method to perform the same task

Remember that the .query() method expects a string. That string should contain the variable of your dataframe without quotation marks and the comparison. For example, if you had a variable called `name`, you'd use a syntax like:
 `df.query('name == "Jack"')`
 
to bring all observations whose column `name` is exactly equal to `"Jack"` (note that Jack should be within quotation marks because a name is a string in this example).

In [18]:
ufo_vars.query('country == "us"')

       year  month state country ufo_shape  encounter_seconds
0      1949     10    tx      us  cylinder             2700.0
3      1956     10    tx      us    circle               20.0
4      1960     10    hi      us     light              900.0
5      1961     10    tn      us    sphere              300.0
7      1965     10    ct      us      disk             1200.0
...     ...    ...   ...     ...       ...                ...
80327  2013      9    tn      us     light              600.0
80328  2013      9    id      us    circle             1200.0
80329  2013      9    ca      us     other             1200.0
80330  2013      9    va      us    circle                5.0
80331  2013      9    ok      us     cigar             1020.0

[65114 rows x 6 columns]

See which one do you prefer the most and keep using it for the exercises that follow

## For the `ufo_us` dataframe, select only the cases in which the year is in the first decade (2001-2010). Put that in a variable called `ufo_us_2000`.

Check your results.

In [19]:
ufo_us_2000 = ufo_us[(ufo_us['year'] >= 2001) & (ufo_us['year'] <= 2010)]

## Try to do the same without the intermediate step of creating the `ufo_us` dataframe. That is, try to filter the dataset for the cases in which the country is "us" and the year is (2001-2010)



*Hint:* You have to make sure all of these conditions are applied simultaneously - using the `and` (or `&`) operator. Try to understand when to use the `and` and the `&` operator.

In [20]:
cols = ['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']
mask = ((ufo_vars['country'] == 'us') & (ufo_us['year'] >= 2001) & (ufo_us['year'] <= 2010))


ufo_us_2000 = ufo[cols][mask]


ufo_us_2000

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

## BONUS 1:  Compare the number of triangular UFO occurrances (checking the `ufo_shape` variable) in the US from the year 2001 up to 2010 as compared to the years of 1991 up to 2000.

*Hint: you should expect roughly ~3 times more cases for 2001-2010 than 1991-2000.*

In [21]:
# calculate the dataframe from 2001-2010 here
cols = ['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']
mask = ((ufo_vars['country'] == 'us') & 
        (ufo_us['ufo_shape'] == 'triangle'))

ufo_us_tri = ufo[cols][mask]

mask00 = ((ufo_us_tri['year'] >= 2001) & (ufo_us_tri['year'] <= 2010))

twothousands = ufo_us_tri[mask00]

In [22]:
# calculate the dataframe from 1991-2000 here
mask90 = ((ufo_us_tri['year'] >= 1991) & (ufo_us_tri['year'] <= 2000))
nineties = ufo_us_tri[mask90]

How many rows does each dataset have?

In [23]:
# There are at least 3 ways to count rows from a dataframe, from slowest to fastest: 
# df.shape < df[0].count() < len(df.index)

ratio = len(twothousands.index) / len(nineties.index)

# Answer

print(f'There are {round(ratio)} times more triangle-shaped ufo sights in the 2000s than in the 90s')

There are 3 times more triangle-shaped ufo sights in the 2000s than in the 90s

## BONUS 1.1: How many values does each category of `ufo_shape` has.

In [24]:
counts = ufo['ufo_shape'].value_counts()

frase = ' ,'.join([f'{counts.index[i]}: {counts[i]}' for i in range(len(counts))])
    
print('The number of ufo sights for each category is > ' + frase + '.')

The number of ufo sights for each category is > light: 16565 ,triangle: 7865 ,circle: 7608 ,fireball: 6208 ,other: 5649 ,unknown: 5584 ,sphere: 5387 ,disk: 5213 ,oval: 3733 ,formation: 2457 ,cigar: 2057 ,changing: 1962 ,flash: 1328 ,rectangle: 1297 ,cylinder: 1283 ,diamond: 1178 ,chevron: 952 ,egg: 759 ,teardrop: 750 ,cone: 316 ,cross: 233 ,delta: 7 ,crescent: 2 ,round: 2 ,hexagon: 1 ,flare: 1 ,dome: 1 ,pyramid: 1 ,changed: 1.

# Lab-Data-Manipulation (PART-2)

The second part of this lab consists of grouping and merging results.

# Grouping up the results.

## Let's calculate the average of the encounter for each country.

We should now group the results by the country column to see what is the mean encounter_seconds for each country. Do this using the `groupby` method of your dataframe `ufo_vars`. What is the average of the encounter for the us? And for Canada?

Remember that after grouping by a column, you have to specify a `aggregating function`. If you don't do that, the results of the groupby will only be a `groupby` pandas object. For this case, we want the aggregating function to be the `mean` function and then the results will appear for us.

Also remember that **if you don't** specify the `as_index=False` argument, the variables you use to group are going to become your new indexes.

In [25]:
ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]
ufo_vars = ufo_vars.rename({'encounter_length': 'encounter_seconds'}, axis=1)

ufo_vars.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
1  1949     10    tx     NaN     light             7200.0
2  1955     10   NaN      gb    circle               20.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0

In [26]:
mask = (ufo_vars['country'] == 'us') | (ufo_vars['country'] == 'ca')

ufo_vars[mask].groupby(by='country', as_index = False).agg(np.mean).round()

  country    year  month  encounter_seconds
0      ca  2004.0    7.0            28859.0
1      us  2004.0    7.0             5800.0

In [27]:
ufo_vars[mask].groupby(by='country')

## Perform the same task, but instead of calculating the mean, count how many occurrances for each country.

For this case, the aggregating function should be the `count` function. Try to understand the results for each column.

In [28]:
display(ufo_vars.groupby(by='country', as_index = False).count())

print('''python somou, para cada coluna, quantos rows contém dados. Ele não conta NaN e, portanto, o ufo_shape e encounter_seconds,
possuem uma discrepância em relação a year, que provavelmente não possui NaNs... o método value_counts() é melhor nessas horas''')

  country   year  month  state  ufo_shape  encounter_seconds
0      au    538    538     10        527                538
1      ca   3000   3000   2985       2955               3000
2      de    105    105      0        103                105
3      gb   1905   1905     12       1855               1905
4      us  65114  65114  65114      63561              65112

python somou, para cada coluna, quantos rows contém dados. Ele não conta NaN e, portanto, o ufo_shape e encounter_seconds,
possuem uma discrepância em relação a year, que provavelmente não possui NaNs... o método value_counts() é melhor nessas horas

In [29]:
display(ufo_vars['country'].value_counts())

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

## Perform the same task, but instead of calculating the mean, use the `.describe()` aggregating function to see the effects.

The describe aggregating function will show you several important statistics for the grouped results, such as `mean`, `median`, `standard deviation`, `count`, `max`, `min`, and so on.

*Hint: If it starts to get difficult to see the results, you can tranpose the resulting dataframe by just putting a `.T` at the end.*

In [30]:
ufo_vars.groupby(by='country').describe().round().T

# Para nossa analise, describe é muito útil para juntar em uma só tabela as funções como min, max, std, e os quartis
# Para algumas colunas como 'month' e 'day', ela não é mt útil, mas para year é.
# pode se saber, por exemplo, em que ano foram registradas as primeiras aparições de ovnis, além do tempo mínimo
# em segundos que durou a aparição de um ovni.

country                         au          ca         de          gb  \
year              count      538.0      3000.0      105.0      1905.0
                  mean      2003.0      2004.0     2002.0      2004.0
                  std          9.0         9.0       12.0         8.0
                  min       1958.0      1936.0     1962.0      1943.0
                  25%       2001.0      2002.0     2000.0      2002.0
                  50%       2004.0      2005.0     2006.0      2005.0
                  75%       2007.0      2010.0     2009.0      2009.0
                  max       2014.0      2014.0     2014.0      2014.0
month             count      538.0      3000.0      105.0      1905.0
                  mean         6.0         7.0        6.0         7.0
                  std          3.0         3.0        3.0         3.0
                  min          1.0         1.0        1.0         1.0
                  25%          3.0         5.0        4.0         4.0
                  50%          6.0         7.0        6.0         7.0
                  75%          9.0         9.0        8.0         9.0
                  max         12.0        12.0       12.0        12.0
encounter_seconds count      538.0      3000.0      105.0      1905.0
                  mean      3806.0     28859.0    24256.0     66061.0
                  std      54341.0   1511732.0   185999.0   2314714.0
                  min          0.0         0.0        2.0         0.0
                  25%         30.0        20.0       30.0        30.0
                  50%        180.0       120.0      180.0       180.0
                  75%        600.0       600.0      600.0       600.0
                  max    1209600.0  82800000.0  1814400.0  97836000.0

country                          us
year              count     65114.0
                  mean       2004.0
                  std          10.0
                  min        1910.0
                  25%        2001.0
                  50%        2007.0
                  75%        2011.0
                  max        2014.0
month             count     65114.0
                  mean          7.0
                  std           3.0
                  min           1.0
                  25%           4.0
                  50%           7.0
                  75%          10.0
                  max          12.0
encounter_seconds count     65112.0
                  mean       5800.0
                  std      404520.0
                  min           0.0
                  25%          30.0
                  50%         180.0
                  75%         600.0
                  max    66276000.0

## Now, let's get deeper in the analysis and group the results not only by country. But by `country` and `year`

### Check the values of the mean and count for the `encounter_seconds` variable for each year. Can you see some discrepancy?

*Hint*: If you want, you can use the `ufo_us` dataset just to see the results for the united states. You could also (in a hacky way) perform the filter right before the groupby operation if you wanted.

In [49]:
df1 = ufo_vars.groupby(by=['country','year']).mean().loc[:,'encounter_seconds']
df2 = ufo_vars.groupby(by=['country','year']).sum().loc[:,'encounter_seconds']

pd.merge(df1,df2, left_index=True, right_index = True, suffixes=('_mean','_sum'))

#we can see some similarities in some years, since there were years in which just one sighting was recorded

              encounter_seconds_mean  encounter_seconds_sum
country year
au      1958             2700.000000                2700.00
        1960              180.000000                 180.00
        1967              300.000000                 300.00
        1968              300.000000                 300.00
        1972              403.333333                1210.00
...                              ...                    ...
us      2010             2271.987232             8061010.70
        2011             2544.292555            11141457.10
        2012            10640.644916            67248875.87
        2013             1266.387888             7669245.05
        2014              782.372979             1536580.53

[282 rows x 2 columns]

# BONUS 2: Which months are the ones with the highest numbers of occurrences?

In [75]:
# We can check the months with highest numbers using a groupby with count, and then sorf values for year.
# Each year is an occurence, so the "number of years" is the "number of occurrences"

ufo_vars.groupby(by='month').count().loc[:,['year']].sort_values(by='year', ascending=False)

#therefore, July is the month with most occurrences, which makes sense, since most sightings recorded come from
#countries of the north hemisphere and its summer there during june-july-august, so people will get out more often,
#and there is more sunlight.

       year
month
7      9520
8      8636
6      8152
9      7589
10     7407
11     6739
1      5689
12     5665
4      5527
3      5450
5      5293
2      4665

# BONUS 3: Finally, you gathered information about the UFO dataset. Using your last result, try to bring that information for your original dataset.

1. Store the results of your previous analysis (the mean value for the encounter_seconds for each year and each country) in a dataframe called `avg_results`.

In [94]:
avg_results = ufo_vars.groupby(by=['country','year']).mean().round().loc[:,['encounter_seconds']]

In [95]:
avg_results

              encounter_seconds
country year
au      1958             2700.0
        1960              180.0
        1967              300.0
        1968              300.0
        1972              403.0
...                         ...
us      2010             2272.0
        2011             2544.0
        2012            10641.0
        2013             1266.0
        2014              782.0

[282 rows x 1 columns]

2. Rename the column named `encounter_seconds` to `avg_encounter_seconds`.

In [96]:
avg_results = avg_results.rename({'encounter_seconds': 'avg_encounter_seconds'}, axis='columns')
avg_results

              avg_encounter_seconds
country year
au      1958                 2700.0
        1960                  180.0
        1967                  300.0
        1968                  300.0
        1972                  403.0
...                             ...
us      2010                 2272.0
        2011                 2544.0
        2012                10641.0
        2013                 1266.0
        2014                  782.0

[282 rows x 1 columns]

In [97]:
avg_results = avg_results.reset_index()
avg_results

    country  year  avg_encounter_seconds
0        au  1958                 2700.0
1        au  1960                  180.0
2        au  1967                  300.0
3        au  1968                  300.0
4        au  1972                  403.0
..      ...   ...                    ...
277      us  2010                 2272.0
278      us  2011                 2544.0
279      us  2012                10641.0
280      us  2013                 1266.0
281      us  2014                  782.0

[282 rows x 3 columns]

3. Use the pd.merge( ... ) function to bring that new collected information to your original dataset.
The pd.merge() function requires several arguments, let's understand the most important ones.

`left` is the dataframe you want to bring information **to** - the table on the left. In this case, this will be our original dataframe called `ufo`

`right` is the dataframe you want to bring information **from** - the table on the right. In this case, this will be our resulting dataframe `avg_results`.

`on` is the key you want to perform the merge. That is, if those values are **exactly equal** in both dataframes, then the information will be brought.

Put your results on a dataframe called `merged_ufo`

In [100]:
merged_ufo = pd.merge(left=ufo,right=avg_results,on=['year','country'])

Check how many rows the final result has and try to explain it. Did the dataset get smaller? Bigger? Or the same? Can you explain why? 

*hint: If you've found something weird, try looking back at your original dataframe and find something interesting on it.*

In [112]:
n_country_nan = ufo.country.isna().sum()

print(f'''
            The original dataframe (ufo) has {ufo.shape[0]} rows, meanwhile merged_ufo has {merged_ufo.shape[0]} rows.
            This difference is due to the number of missing values in column 'country', which is {n_country_nan}.
            The merge wont add those rows with NaN, unles we use 'outer' as the "on" argument.
            
''')

            The original dataframe (ufo) has 80332 rows, meanwhile merged_ufo has 70662 rows.
            This difference is due to the number of missing values in column 'country', which is 9670.
            The merge wont add those rows with NaN, unles we use 'outer' as the "on" argument.

## Store the results into a new csv file called `ufo_enriched.csv`. 

Don't forget to use `index=False`.

In [113]:
merged_ufo.to_csv('ufo_enriched.csv',index=False)